[{
        "document": "lihkg_analytics_dashboard.txt",
        "info": {
            "Mame": "Lihkg Analytics Dashboard",
            "Description": "Scraped 800K+ records from a Hong Kong based online forum with 9th highest internet traffic, and built a dashboard to display findings and insights about the website in 2021, e.g. popular topics, gender distribution by channel, user growth, etc.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "ml_from_scratch.txt",
        "info": {
            "Mame": "Machine Learning from Scratch",
            "Description": "Built various mainstream machine learning algorithms (e.g. Decision Tree, Random Forest, Neural Network) from scratch using minimal external libraries.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "bit_art_maker.txt",
        "info": {
            "Mame": "Bit Art Maker",
            "Description": "A simple drawing application on the web to create 8-bit pixel art.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "top_pandas_function.txt",
        "info": {
            "Mame": "Top Pandas Function",
            "Description": "Built a pipeline to scrape and process source code from 1,000+ data science notebooks collected from Kaggle and identified the most widely used Pandas functions and data science libraries.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "movie_recommender.txt",
        "info": {
            "Mame": "Movie Recommendation System",
            "Description": "Implemented various recommendation algorithms including content-based recommendation using TFIDF and collaborative filtering using SVD.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "nba_eda.txt",
        "info": {
            "Mame": "Exploratory Data Analysis of NBA Shot Logs",
            "Description": "Based on data of the 14-15 season, explored various areas relating to offense and defense of teams and individual players, e.g. most effective defensive players, teams' play style, hot hand phenomenon, etc.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "sentiment_classification.txt",
        "info": {
            "Mame": "Restaurant Review Sentiment Classification",
            "Description": "Scraped ~1M records from the largest restaurant guide in HK and developed a 3-classes (positive, neutral, negative) sentiment classification model with 70% accuracy using Word2Vec and BiLSTM.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "doggo_classification.txt",
        "info": {
            "Mame": "Dog Image Recognition",
            "Description": "Developed a convolution neural network to identify 120 dog breeds with 88% validation accuracy using transfer learning with InceptionResNetV2, and deployed the model on a web app to showcase the results.",
            "Link": "www.example.com"
        }
    },
    {
        "document": "restaurant_pop_prediction.txt",
        "info": {
            "Mame": "Restaurant Popularity Prediction",
            "Description": "Scraped 12,000+ records and developed a model with XGBoost that predicts restaurant popularity based on various factors, such as location, cuisine type and price range.",
            "Link": "www.example.com"
        }
    }
]